nickdpz/Contol-de-hogar-con-PSoC-5-LP-ESP8266-y-Blink/PSoC/Domoticaconblink.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "UART.h"
#include "LCD.h"
#include "IRQRX.h"
#include "I2C.h"
#include "I2C_PVT.h"
#include "SDA_aliases.h"
#include "SDA.h"
#include "SCL_aliases.h"
#include "SCL.h"
#include "PWM.h"
#include "CLK.h"
#include "PSala_aliases.h"
#include "PSala.h"
#include "PHabitacion_aliases.h"
#include "PHabitacion.h"
#include "PINA_aliases.h"
#include "PINA.h"
#include "PINB_aliases.h"
#include "PINB.h"
#include "PINC_aliases.h"
#include "PINC.h"
#include "PIND_aliases.h"
#include "PIND.h"
#include "EEPROM.h"
#include "ADC.h"
#include "PTEMP_aliases.h"
#include "PTEMP.h"
#include "PINMOV_aliases.h"
#include "PINMOV.h"
#include "ISR_MOV.h"
#include "UART_IntClock.h"
#include "LCD_LCDPort_aliases.h"
#include "LCD_LCDPort.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "cy_em_eeprom.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"

/*[]*/

